var namesKeyValue = {"赵":"Z","钱":"Q","孙":"S","李":"L","周":"Z","吴":"W","郑":"Z","王":"W","冯":"F","陈":"C","褚":"Z","卫":"W","蒋":"J","沈":"S","韩":"H","杨":"Y","朱":"Z","秦":"Q","尤":"Y","许":"X","何":"H","吕":"L","施":"S","张":"Z","孔":"K","曹":"C","严":"Y","华":"H","金":"J","魏":"W","陶":"T","姜":"J","戚":"Q","谢":"X","邹":"Z","喻":"Y","柏":"B","水":"S","窦":"D","章":"Z","云":"Y","苏":"S","潘":"P","葛":"G","奚":"X","范":"F","彭":"P","郎":"L","鲁":"L","韦":"W","昌":"C","马":"M","苗":"M","凤":"F","花":"H","方":"F","俞":"Y","任":"R","袁":"Y","柳":"L","酆":"F","鲍":"B","史":"S","唐":"T","费":"F","廉":"L","岑":"C","薛":"X","雷":"L","贺":"H","倪":"N","汤":"T","滕":"T","殷":"Y","罗":"L","毕":"B","郝":"H","邬":"W","安":"A","常":"C","乐":"L","于":"Y","时":"S","傅":"F","皮":"P","卞":"B","齐":"Q","康":"K","伍":"W","余":"Y","元":"Y","卜":"B","顾":"G","孟":"M","平":"P","黄":"H","和":"H","穆":"M","萧":"X","尹":"Y","姚":"Y","邵":"S","湛":"Z","汪":"W","祁":"Q","毛":"M","禹":"Y","狄":"D","米":"M","贝":"B","明":"M","臧":"Z","计":"J","伏":"F","成":"C","戴":"D","谈":"T","宋":"S","茅":"M","庞":"P","熊":"X","纪":"J","舒":"S","屈":"Q","项":"X","祝":"Z","董":"D","梁":"L","杜":"D","阮":"R","蓝":"L","闵":"M","席":"X","季":"J","麻":"M","强":"Q","贾":"G","路":"L","娄":"L","危":"W","江":"J","童":"T","颜":"Y","郭":"G","梅":"M","盛":"S","林":"L","刁":"D","钟":"Z","徐":"X","邱":"Q","骆":"L","高":"G","夏":"X","蔡":"C","田":"T","樊":"F","胡":"H","凌":"L","霍":"H","虞":"Y","万":"W","支":"Z","柯":"K","咎":"J","管":"G","卢":"L","莫":"M","经":"J","房":"F","裘":"Q","缪":"M","干":"G","解":"J","应":"Y","宗":"Z","宣":"X","丁":"D","贲":"B","邓":"D","郁":"Y","单":"D","杭":"H","洪":"H","包":"B","诸":"Z","左":"Z","石":"S","崔":"C","吉":"J","钮":"N","龚":"G","程":"C","嵇":"J","邢":"X","滑":"H","裴":"P","陆":"L","荣":"R","翁":"W","荀":"X","羊":"Y","於":"Y","惠":"H","甄":"Z","加":"J","封":"F","芮":"R","羿":"Y","储":"C","靳":"J","汲":"J","邴":"B","糜":"M","松":"S","井":"J","段":"D","富":"F","巫":"W","乌":"W","焦":"J","巴":"B","弓":"G","牧":"M","隗":"W","山":"S","谷":"G","车":"C","侯":"H","宓":"M","蓬":"P","全":"Q","郗":"X","班":"B","仰":"Y","秋":"Q","仲":"Z","伊":"Y","宫":"G","宁":"N","仇":"C","栾":"L","暴":"B","甘":"G","钭":"D","厉":"L","戎":"R","祖":"Z","武":"W","符":"F","刘":"L","詹":"Z","束":"S","龙":"L","叶":"Y","幸":"X","司":"S","韶":"S","郜":"G","黎":"L","蓟":"J","薄":"B","印":"Y","宿":"S","白":"B","怀":"H","蒲":"P","台":"T","从":"C","鄂":"E","索":"S","咸":"X","籍":"J","赖":"L","卓":"Z","蔺":"L","屠":"T","蒙":"M","池":"C","乔":"Q","阴":"Y","胥":"X","能":"N","苍":"C","双":"S","闻":"W","莘":"S","党":"D","翟":"D","谭":"T","贡":"G","劳":"L","逄":"P","姬":"J","申":"S","扶":"F","堵":"D","冉":"R","宰":"Z","郦":"L","雍":"Y","却":"Q","璩":"Q","桑":"S","桂":"G","濮":"P","牛":"N","寿":"S","通":"T","边":"B","扈":"H","燕":"Y","冀":"J","郏":"J","浦":"P","尚":"S","农":"N","温":"W","别":"B","庄":"Z","晏":"Y","柴":"C","瞿":"Q","阎":"Y","充":"C","慕":"M","连":"L","茹":"R","习":"X","宦":"H","艾":"A","鱼":"Y","容":"R","向":"X","古":"G","易":"Y","慎":"S","戈":"G","廖":"L","庚":"G","终":"Z","暨":"J","居":"J","衡":"H","步":"B","都":"D","耿":"G","满":"M","弘":"H","匡":"K","国":"G","文":"W","寇":"K","广":"G","禄":"L","阙":"Q","东":"D","殴":"O","殳":"S","沃":"W","利":"L","蔚":"W","越":"Y","夔":"K","隆":"L","师":"S","巩":"G","厍":"S","聂":"N","晁":"C","勾":"G","敖":"A","融":"R","冷":"L","訾":"Z","辛":"X","阚":"K","那":"N","简":"J","饶":"R","空":"K","曾":"Z","毋":"W","沙":"S","乜":"M","养":"Y","鞠":"J","须":"X","丰":"F","巢":"C","关":"G","蒯":"K","相":"X","查":"C","后":"H","红":"H","游":"Y","竺":"Z","权":"Q","逯":"L","盖":"G","益":"Y","桓":"H","公":"G","俟":"S","上":"S","官":"G","欧":"O","阳":"Y","人":"R","赫":"H","皇":"H","甫":"F","尉":"W","迟":"C","澹":"D","冶":"Y","政":"Z","淳":"C","太":"T","叔":"S","正":"Z","轩":"X","辕":"Y","令":"L","狐":"H","离":"L","闾":"L","丘":"Q","长":"C","鲜":"X","宇":"Y","徒":"T","亓":"Q","仉":"Z","督":"D","子":"Z","颛":"Z","端":"D","木":"M","西":"X","漆":"Q","雕":"D","壤":"R","驷":"S","良":"L","拓":"T","拔":"B","夹":"J","父":"F","粱":"L","晋":"J","楚":"C","法":"F","汝":"R","鄢":"Y","涂":"T","钦":"Q","百":"B","里":"L","南":"N","门":"M","呼":"H","延":"Y","归":"G","海":"H","舌":"S","微":"W","生":"S","岳":"Y","帅":"S","缑":"G","亢":"K","况":"K","有":"Y","琴":"Q","商":"S","牟":"M","佘":"S","佴":"E","伯":"B","赏":"S","墨":"M","哈":"H","谯":"Q","笪":"D","年":"N","爱":"A","佟":"T","第":"D","五":"W","言":"Y","福":"F","家":"J","姓":"X","续":"X"};

/*
arr: [{name:'张三',age:18},{name:'张四',age:15},{name:'王五',age:12}]
key: name
*/
function nameToPinyin(arr, key) {
    var retArr = [];

    for (var i = 0; i < arr.length; i++) {
        var json = arr[i];
        if (typeof json[key] !== 'string') break;

        var xinshi = json[key][0];//姓氏
        var value = namesKeyValue[xinshi];
        value = value || '-';
        retArr = filterJson(retArr,value,json);
    }
    return retArr;
}

/*
arr:[
        {key:'Z',value:[{name:'张三',age:18},{name:'张四',age:15}]},
        {key:'W',value:[{name:'王五',age:12}]}
    ]
key:'A' / 'B' （单字母）
json:{name:'龙九',age:19}
*/
function filterJson(arr,key,json) {
    var findIndex = -1;
    for (var i = 0; i < arr.length; i++) {
        if (arr[i].key === key) {
            findIndex = i;
            arr[i].value.push(json);
            break;
        }
    }
    (findIndex == -1) && arr.push({key,value:[json]})

    return arr;
}

/*
var ret = nameToPinyin([{
    name:'张三',
    age:'18'
},{
    name:'李四',
    age:'16'
},{
    name:'张五',
    age:'18'
},{
    name:'侯六',
    age:'14'
},{
    name:'谢五',
    age:'19'
},{
    name:'谢久',
    age:'18'
}],'name')

console.log(JSON.stringify(ret));
*/

/*
打印结果

[{"key":"Z","value":[{"name":"张三","age":"18"},{"name":"张五","age":"18"}]},{"key":"L","value":[{"name":"李四","age":"16"}]},{"key":"H","value":[{"name":"侯六","age":"14"}]},{"key":"X","value":[{"name":"谢五","age":"19"},{"name":"谢久","age":"18"}]}]

*/

export default nameToPinyin;
